testing/performance/scalability-test-1000plus.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warmup phase
    - duration: 30
      arrivalRate: 20
      name: "Initial warmup"
    # Gradual ramp-up to 100 users
    - duration: 60
      arrivalRate: 50
      name: "Ramp to 100 users"
    # Ramp-up to 500 users
    - duration: 120
      arrivalRate: 100
      name: "Ramp to 500 users"
    # Scale to 1000+ users
    - duration: 300
      arrivalRate: 200
      name: "Scale to 1000+ users"
    # Peak load test
    - duration: 180
      arrivalRate: 300
      name: "Peak load (1500+ users)"
    # Stress test
    - duration: 60
      arrivalRate: 500
      name: "Stress test (2000+ users)"
    # Cool down
    - duration: 60
      arrivalRate: 50
      name: "Cool down"
  processor: "./load-test-processor.js"
  variables:
    blockchainNetwork: "polygon-mumbai"
    testWallet: "0x1234567890123456789012345678901234567890"
    testFile: "test-data.json"
    totalUsers: 2000
  plugins:
    expect: {}
    metrics-by-endpoint: {}
    pubsub: {}
    statsd: {}
    retry: {}
    clock: {}

scenarios:
  - name: "SylOS Desktop - 2000+ User Load"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: "text/html"
      - think: 1
      - post:
          url: "/api/wallet/connect"
          json:
            method: "eth_requestAccounts"
            params: []
          expect:
            - statusCode: 200
            - hasProperty: "address"
      - think: 0.5
      - get:
          url: "/api/wallet/balance/{{ testWallet }}"
          expect:
            - statusCode: 200
            - hasProperty: "sylos_balance"
            - hasProperty: "eth_balance"
      - think: 0.5
      - get:
          url: "/api/pop/score/{{ testWallet }}"
          expect:
            - statusCode: 200
            - hasProperty: "score"
            - hasProperty: "tier"
      - think: 1
      - get:
          url: "/api/tokens/portfolio"
          json:
            wallet: "{{ testWallet }}"
          expect:
            - statusCode: 200
            - hasProperty: "total_value"
            - hasProperty: "holdings"
      - think: 2
      # Simulate app launches
      - get:
          url: "/api/apps/launch"
          json:
            app: "wallet"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "app_id"
      - think: 0.5
      - get:
          url: "/api/apps/launch"
          json:
            app: "pop-tracker"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "app_id"
      - think: 2

  - name: "PoP Consensus - High Throughput"
    weight: 25
    flow:
      # Concurrent task verification
      - post:
          url: "/api/pop/verify_task"
          json:
            task_id: "task_{{ $randomInt(1, 10000) }}"
            wallet: "{{ testWallet }}"
            productivity_score: "{{ $randomInt(1000, 10000) }}"
            verification_data: "verification_data_{{ $randomString() }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "verified"
            - hasProperty: "points_awarded"
      - think: 0.1
      - post:
          url: "/api/pop/verify_task"
          json:
            task_id: "task_{{ $randomInt(1, 10000) }}"
            wallet: "{{ testWallet }}"
            productivity_score: "{{ $randomInt(1000, 10000) }}"
            verification_data: "verification_data_{{ $randomString() }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
      - think: 0.1
      - post:
          url: "/api/pop/verify_task"
          json:
            task_id: "task_{{ $randomInt(1, 10000) }}"
            wallet: "{{ testWallet }}"
            productivity_score: "{{ $randomInt(1000, 10000) }}"
            verification_data: "verification_data_{{ $randomString() }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
      - think: 0.5
      # Reward calculations
      - post:
          url: "/api/pop/calculate_reward"
          json:
            score: "{{ $randomInt(5000, 15000) }}"
            tier: "{{ $randomChoice(['Bronze', 'Silver', 'Gold', 'Diamond']) }}"
            week: "{{ $randomInt(1, 52) }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "weekly_reward"
            - hasProperty: "monthly_projection"
      - think: 0.5
      # Tier updates
      - post:
          url: "/api/pop/update_tier"
          json:
            current_score: "{{ $randomInt(8000, 12000) }}"
            previous_score: "{{ $randomInt(6000, 10000) }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "new_tier"
            - hasProperty: "tier_changed"
      - think: 1

  - name: "IPFS Storage - Heavy Load"
    weight: 20
    flow:
      # Multiple concurrent uploads
      - post:
          url: "/api/ipfs/upload"
          json:
            filename: "file_{{ $randomString() }}.txt"
            content: "Test content for load testing {{ $randomString() }}"
            encrypted: false
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "cid"
            - hasProperty: "size"
      - think: 0.2
      - post:
          url: "/api/ipfs/upload"
          json:
            filename: "image_{{ $randomString() }}.png"
            content: "base64_encoded_image_data_{{ $randomString() }}"
            encrypted: true
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
      - think: 0.2
      # Concurrent retrievals
      - get:
          url: "/api/ipfs/cat/{{ $randomChoice(['QmXwN9dYd4T8J2kF3mZpA8hE9xN5vL2qR4mN7bC6dF3gH1jK5mN', 'QmYf7rEs2R6gQ5hP3xKvT8uJ2nM5pL4kF9dS7wE3rT6yU1iO3pQ', 'QmA1B2C3D4E5F6G7H8I9J0K1L2M3N4O5P6Q7R8S9T0U1V2']) }}"
          expect:
            - statusCode: 200
            - hasProperty: "content"
      - think: 0.2
      - get:
          url: "/api/ipfs/cat/{{ $randomChoice(['QmZxCv9rEs3hF5vK8wL9mR6tS8uN5pQ4kF2dS7wE3rT6yU1iO3pQ', 'QmB2C3D4E5F6G7H8I9J0K1L2M3N4O5P6Q7R8S9T0U1V2W3X4']) }}"
          expect:
            - statusCode: 200
      - think: 0.5
      # List operations
      - get:
          url: "/api/ipfs/ls"
          json:
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "files"
            - property: "files.length" < 100
      - think: 1

  - name: "Token Operations - Burst Load"
    weight: 15
    flow:
      # Multiple concurrent transfers
      - post:
          url: "/api/tokens/transfer"
          json:
            token: "SYLOS"
            from: "{{ testWallet }}"
            to: "0x{{ $randomHex(40) }}"
            amount: "{{ $randomInt(1, 1000) }}"
            gas_price: "{{ $randomInt(10, 50) }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "transaction_hash"
            - hasProperty: "gas_used"
      - think: 0.1
      - post:
          url: "/api/tokens/transfer"
          json:
            token: "wSYLOS"
            from: "{{ testWallet }}"
            to: "0x{{ $randomHex(40) }}"
            amount: "{{ $randomInt(10, 10000) }}"
            gas_price: "{{ $randomInt(5, 25) }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
      - think: 0.1
      # Staking operations
      - post:
          url: "/api/tokens/stake"
          json:
            token: "SYLOS"
            amount: "{{ $randomInt(100, 10000) }}"
            lock_period: "{{ $randomChoice([30, 60, 90, 180, 365]) }}"
            staking_pool: "default"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "stake_id"
            - hasProperty: "apy"
      - think: 0.5
      # Portfolio queries
      - get:
          url: "/api/tokens/price/track"
          json:
            tokens: ["SYLOS", "wSYLOS", "ETH", "MATIC", "BNB"]
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "prices"
            - property: "prices" != {}
      - think: 1

  - name: "Real-time Updates - WebSocket Load"
    weight: 10
    flow:
      # WebSocket connection for real-time updates
      - get:
          url: "/ws/updates"
          capture:
            - json: "$.type"
              as: "message_type"
          expect:
            - statusCode: 101
            # WebSocket upgrade
      - think: 0.5
      # Subscribe to multiple feeds
      - post:
          url: "/ws/subscribe"
          json:
            channels: ["price_updates", "pop_scores", "network_status"]
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "subscription_id"
      - think: 3
      # Periodic updates
      - get:
          url: "/api/realtime/stats"
          expect:
            - statusCode: 200
            - hasProperty: "active_connections"
            - hasProperty: "messages_per_second"
      - think: 2

  # Distributed load from multiple "regions"
  - name: "Geographic Distribution - Simulated"
    weight: 5
    flow:
      # Simulate users from different regions
      - get:
          url: "/api/geo/region"
          json:
            region: "{{ $randomChoice(['us-east', 'us-west', 'eu-west', 'asia-pacific']) }}"
            user_id: "user_{{ $randomInt(1, 2000) }}"
          expect:
            - statusCode: 200
            - hasProperty: "region"
            - hasProperty: "latency"
      - think: 1
      # Region-specific operations
      - get:
          url: "/api/pop/leaderboard"
          json:
            region: "{{ $randomChoice(['us-east', 'us-west', 'eu-west', 'asia-pacific']) }}"
            limit: 100
          expect:
            - statusCode: 200
            - hasProperty: "leaderboard"
            - hasProperty: "user_rank"
      - think: 2

# Performance thresholds
ensure:
  # Response time thresholds
  p(95): 2000 # 95% of requests should complete within 2 seconds
  p(99): 5000 # 99% of requests should complete within 5 seconds
  
  # Error rate threshold
  p(99.9): 0.01 # Less than 1% error rate
  
  # Throughput requirements
  requestsPerSecond: 500 # Should handle 500+ requests per second
  
  # Database connection pool
  dbConnections: 100 # Should handle 100+ concurrent database connections